# https://github.com/Homebrew/homebrew-bundle

tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "olets/tap"
tap "oven-sh/bun"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"

# Homebrew
# https://github.com/Homebrew/brew/

# openssl needs to be installed before libyaml, maybe others
brew "openssl@1.1"
brew "openssl@3"

brew "advancecomp"
brew "ansible"
brew "asciidoctor"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "btop"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "docutils"
brew "dos2unix"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fish"
brew "fontforge"
brew "fonttools"
brew "fzf"
brew "gcc"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp"
brew "gnu-sed"
brew "highlight"
brew "htop"
brew "httpie"
brew "hugo"
brew "icu4c@76"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "lazygit"
brew "less"
brew "libpq"
brew "libtermkey"
brew "libyaml"
brew "lynx"
brew "mas"
brew "media-info"
brew "memcached"
brew "most"
brew "neofetch"
brew "neovim"
brew "node"
brew "olets/tap/zsh-abbr"
brew "onefetch"
brew "ossp-uuid"
brew "oven-sh/bun/bun"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "php"
brew "pillow" # required for image previews
brew "poppler" # required for pdf previews
brew "postgresql@17", restart_service: true
brew "pkgconf"
brew "pstree"
brew "python"
brew "readline"
brew "redis", restart_service: true
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "stripe/stripe-cli/stripe"
brew "teamookla/speedtest/speedtest"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "unar"
brew "universal-ctags"
brew "vips"
brew "w3m"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh"

# homebrew-cask
# https://github.com/Homebrew/homebrew-cask

cask "1password-cli"
cask "alfred"
cask "bartender"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "firefox"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "google-drive"
cask "grammarly-desktop"
cask "hazel"
cask "istat-menus"
cask "kitty"
cask "loom"
cask "messenger"
# cask "ngrok"
cask "notion"
cask "obsidian"
cask "postico"
cask "signal"
cask "tableplus"
cask "telegram"
cask "todoist"
cask "viber"
cask "whatsapp"

mas "1Password for Safari", id: 1569813296
mas "e-Sword X", id: 968437868
mas "Keynote", id: 409183694
# mas "Logic Pro", id: 634148309
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Speedtest", id: 1153157709
mas "Toggl Track", id: 1291898086

# vim: set filetype=ruby:
