# https://github.com/Homebrew/homebrew-bundle

tap "olets/tap"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"

# Homebrew
# https://github.com/Homebrew/brew/

brew "advancecomp"
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "ansible"
brew "asciidoctor"
brew "asdf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bats-core"
brew "btop"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "docutils"
brew "dos2unix"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "gcc"
brew "fastfetch"
brew "fish"
brew "flyctl"
brew "fontforge"
brew "fonttools"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "hadolint"
brew "pkgconf"
brew "highlight"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "libpq"
brew "libtermkey"
brew "lynx"
brew "markdownlint-cli2"
brew "mas"
brew "media-info"
brew "memcached"
brew "most"
brew "neovim"
brew "node"
brew "onefetch"
brew "ossp-uuid"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "php"
brew "pillow"
brew "pinentry-mac"
brew "poppler"
brew "postgresql@17"
brew "pstree"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "tealdeer"
brew "telnet"
brew "the_silver_searcher"
brew "trash"
brew "tree"
brew "unar"
brew "universal-ctags"
brew "urlview"
brew "vips"
brew "w3m"
brew "wget"
brew "wordnet"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "olets/tap/zsh-abbr"
brew "stripe/stripe-cli/stripe"
brew "teamookla/speedtest/speedtest"

# homebrew-cask
# https://github.com/Homebrew/homebrew-cask

# cask "1password-cli"
cask "alfred"
cask "bartender"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "firefox"
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-envy-code-r"
cask "font-envy-code-r-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-drive"
cask "grammarly-desktop"
cask "hazel"
cask "istat-menus"
cask "kitty"
cask "loom"
cask "messenger"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "postico"
cask "qxmledit"
cask "screenflick"
cask "signal"
cask "tableplus"
cask "telegram"
cask "todoist"
cask "viber"
cask "whatsapp"

mas "1Password for Safari", id: 1569813296
mas "e-Sword X", id: 968437868
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Toggl Track", id: 1291898086

# vim: set filetype=ruby:
