tap "1password/tap"
tap "buo/cask-upgrade"
tap "corgibytes/cask-fonts"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "olets/tap"
tap "oven-sh/bun"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "thoughtbot/formulae"
tap "wix/brew"
brew "adns"
brew "advancecomp"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "icu4c"
brew "libnghttp2"
brew "libuv"
brew "openssl@3"
brew "node"
brew "angular-cli"
brew "libyaml"
brew "mpdecimal"
brew "six"
brew "python-packaging"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.12"
brew "pyyaml"
brew "ansible"
brew "giflib"
brew "highway"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "ruby"
brew "asciidoctor"
brew "m4"
brew "gmp"
brew "coreutils"
brew "libtool"
brew "asdf"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "graphite2"
brew "harfbuzz"
brew "openjdk@11"
brew "bazel"
brew "berkeley-db"
brew "blueutil"
brew "btop"
brew "buildifier"
brew "capstone"
brew "chrome-cli"
brew "clang-format"
brew "clang-format@11"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "python-argcomplete"
brew "python-typing-extensions"
brew "commitizen"
brew "copilot"
brew "cowsay"
brew "ctags"
brew "libunistring"
brew "libidn2"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "docker-completion"
brew "docker"
brew "docker-clean"
brew "docker-compose"
brew "dos2unix"
brew "dtc"
brew "libevent"
brew "libsodium"
brew "snappy"
brew "elixir"
brew "eslint"
brew "exa"
brew "eza"
brew "fd"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "ncurses"
brew "fish"
brew "fontforge"
brew "fonttools"
brew "openjdk"
brew "fop"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghc"
brew "gifsicle"
brew "gist"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-quick-stats"
brew "gnu-sed"
brew "libusb"
brew "go"
brew "go@1.20"
brew "jasper"
brew "graphicsmagick"
brew "helm"
brew "lua"
brew "highlight"
brew "htop"
brew "httpie"
brew "httrack"
brew "imagemagick"
brew "jhead"
brew "jpeg"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "less"
brew "libidl"
brew "libscrypt"
brew "libslirp"
brew "libssh"
brew "libtermkey"
brew "libxml2"
brew "z3"
brew "llvm"
brew "lynx"
brew "mackup"
brew "mas"
brew "maven"
brew "media-info"
brew "memcached"
brew "s-lang"
brew "midnight-commander"
brew "minikube"
brew "mkcert"
brew "most"
brew "nano"
brew "navi"
brew "screenresolution"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nspr"
brew "nss"
brew "onefetch"
brew "onnxruntime"
brew "openssl@1.1"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "php"
brew "pillow"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "vde"
brew "qemu"
brew "podman"
brew "poppler"
brew "postgresql@14", restart_service: true
brew "powerlevel10k"
brew "pstree"
brew "pugixml"
brew "pyenv"
brew "python@3.9"
brew "qt@5"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "rust"
brew "rustup-init"
brew "sd"
brew "sheldon"
brew "shellcheck"
brew "sonarqube-lts"
brew "spaceship"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "subversion"
brew "swig"
brew "synergy-core"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tor"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "vip"
brew "w3m"
brew "watchman"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zlib"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "olets/tap/zsh-abbr"
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"
brew "teamookla/speedtest/speedtest"
brew "thoughtbot/formulae/parity"
brew "wix/brew/applesimutils"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "alfred"
cask "anaconda"
cask "azure-data-studio"
cask "bartender"
cask "bbedit"
cask "betterzip"
cask "boom-3d"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "chrome-devtools"
cask "chrome-remote-desktop-host"
cask "chromedriver"
cask "chromium"
cask "copilot"
cask "daisydisk"
cask "deepl"
cask "discord"
cask "dotnet-sdk"
cask "dropbox"
cask "dropbox-capture"
cask "eclipse-ide"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "fig"
cask "figma"
cask "find-any-file"
cask "firefox"
cask "flux"
cask "font-cascadia-code"
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-hack"
cask "font-ia-writer-mono"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-symbols-only-nerd-font"
cask "fontbase"
cask "fontforge"
cask "freedom"
cask "gisto"
cask "github"
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "grammarly-desktop"
cask "hammerspoon"
cask "hyper"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "kitty"
cask "launchbar"
cask "launchcontrol"
cask "little-snitch"
cask "loom"
cask "maccy"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "mycloud"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "path-finder"
cask "plug"
cask "postico"
cask "postman"
cask "powershell"
cask "proton-drive"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "raycast"
cask "rectangle"
cask "rider"
cask "rocket-chat"
cask "screenflick"
cask "signal"
cask "sim-daltonism"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "sublime-text"
cask "syntax-highlight"
cask "tableplus"
cask "telegram"
cask "telegram-desktop"
cask "textmate"
cask "the-unarchiver"
cask "todoist"
cask "viber"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
cask "xcodeclangformat"
cask "yandex-music-unofficial"
cask "zap"
cask "zoom"
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "AIAssistedCoding.ai-assisted-coding"
vscode "alexdima.copy-relative-path"
vscode "AMiner.codegeex"
vscode "Angular.ng-template"
vscode "ankitbko.vscode-pull-request-azdo"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "bierner.markdown-preview-github-styles"
vscode "Blackboxapp.blackbox"
vscode "BracketPairColorDLW.bracket-pair-color-dlw"
vscode "christian-kohler.npm-intellisense"
vscode "chrmarti.regex"
vscode "cipchk.cssrem"
vscode "Codeium.codeium"
vscode "cstechnologies.vscode-storybook"
vscode "cyrilletuzi.angular-schematics"
vscode "DanielSanMedium.dscodegpt"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "funkyremi.vscode-google-translate"
vscode "ghaschel.vscode-angular-html"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "helgardrichard.helium-icon-theme"
vscode "hex-ci.stylelint-plus"
vscode "intellsmi.comment-translate"
vscode "johnpapa.Angular2"
vscode "joshbolduc.story-explorer"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "MS-CEINTL.vscode-language-pack-de"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "natewallace.angular2-inline"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "Nimda.deepdark-material"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-react-native-storybooks"
vscode "PKief.material-icon-theme"
vscode "PKief.material-product-icons"
vscode "pranaygp.vscode-css-peek"
vscode "RamiroBerrelleza.bitbucket-pull-requests"
vscode "redhat.vscode-yaml"
vscode "riccardoforina.storybook-helper"
vscode "richie5um2.vscode-sort-json"
vscode "sburg.vscode-javascript-booster"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SirTori.indenticator"
vscode "SonarSource.sonarlint-vscode"
vscode "sourcegraph.cody-ai"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "syler.sass-indented"
vscode "tal7aouy.rainbow-bracket"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "VisualStudioExptTeam.vscodeintellicode-insiders"
vscode "vsls-contrib.gistfs"
vscode "vunguyentuan.vscode-css-variables"
vscode "ZainChen.json"
