# https://github.com/Homebrew/homebrew-bundle

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "thoughtbot/formulae"
tap "puma/puma"

# Homebrew
# https://github.com/Homebrew/brew/
brew "ansible"
brew "autoconf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "cloc"
brew "cmatrix"
brew "ctags"
brew "dockutil"
brew "dos2unix"
brew "doxygen"
brew "figlet"
brew "freetype"
brew "gdbm"
brew "gettext"
brew "gist"
brew "git"
brew "glib"
brew "homebrew/dupes/rsync"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jpeg"
brew "libevent"
brew "libffi"
brew "libpng"
brew "libssh2"
brew "libtiff"
brew "libtool"
brew "libyaml"
brew "mas"
brew "openssl"
brew "pcre"
brew "perl"
brew "pgcli"
brew "pkg-config"
brew "postgresql", service_restart: true
brew "puma-dev"
brew "python"
brew "rbenv"
brew "rbenv-default-gems"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis", service_restart: true
brew "ruby-build"
brew "shellcheck"
brew "spark"
brew "speedtest_cli"
brew "sqlite"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "thoughtbot/formulae/gitsh"
brew "tmux"
brew "trash"
brew "tree"
brew "unixodbc"
brew "vim"
brew "wget"
brew "xz"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "alfred"
cask "applepi-baker"
cask "atom"
cask "bartender"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "crashplan"
cask "daisydisk"
cask "dash3"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "hazel"
cask "istat-menus"
cask "iterm2"
cask "little-snitch"
cask "ngrok"
cask "opera"
cask "postico"
cask "screenflick"
cask "sketch"
cask "skype"
cask "the-unarchiver"
cask "tunnelbear"
cask "vagrant"
cask "vlc"
cask "vmware-fusion"

# mas-cli
# https://github.com/argon/mas
mas "1Password", id: 443987910
mas "Evernote", id: 406056744
mas "Gemini 2", id: 1090488118
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "OmniFocus", id: 867299399
mas "Pages", id: 409201541
mas "Pimp Your Screen", id: 755444885
mas "Pixelmator", id: 407963104
mas "Scrivener", id: 418889511
mas "Slack", id: 803453959
mas "Tweetbot", id: 557168941
mas "WiFi Explorer", id: 494803304
mas "e-Sword X", id: 968437868
mas "iNet Network Scanner", id: 403304796
mas "iStat Mini", id: 927292435
