# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "universal-ctags/universal-ctags"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "advancecomp"
brew "ansible"
brew "asciidoctor"
brew "autoconf" # asdf dependency
brew "automake" # asdf dependency
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "dos2unix"
brew "exa"
brew "fish"
brew "fontforge"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp" # Vim dependency
brew "gnupg" # asdf-nodejs dependency
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "less"
brew "libtermkey"
brew "libtool" # asdf dependency
brew "libxslt" # asdf dependency
brew "libyaml" # asdf dependency
brew "mas"
brew "media-info"
brew "memcached"
brew "mono"
brew "most"
brew "multitail"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "onefetch"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "postgresql", restart_service: true
brew "puma/puma/puma-dev"
brew "python"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unixodbc" # asdf dependency
brew "w3m"
brew "wget"
brew "xz"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "1password"
cask "alacritty"
cask "alfred"
cask "arq"
cask "bartender"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "clover-configurator"
cask "daisydisk"
cask "dash"
cask "discord"
cask "dropbox"
cask "expressvpn"
cask "fantastical"
cask "firefox"
cask "font-caskaydiacove-nerd-font"
cask "font-firacode-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrainsmono-nerd-font"
cask "font-victormono-nerd-font"
cask "google-chrome"
cask "handbrake"
cask "hazel"
cask "istat-menus"
cask "iterm2-beta"
cask "little-snitch"
cask "micro-snitch"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-word"
cask "ngrok"
cask "opera"
cask "pdftotext"
cask "pgadmin4"
cask "postico"
cask "postman"
cask "screenflick"
cask "skype"
cask "slack"
cask "steam"
cask "tableplus"
cask "telegram"
cask "toggl"
cask "viber"
cask "vlc"
cask "vmware-fusion"
cask "whatsapp"
cask "zoomus"

# rubocop:disable Style/NumericLiterals
mas "Deliveries", id: 924726344
mas "Evernote", id: 406056744
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Spark", id: 1176895641
mas "Things 3", id: 904280696
mas "ToothFairy", id: 1191449274
mas "WiFi Explorer", id: 494803304
mas "e-Sword", id: 968437868
mas "iNet Network Scanner", id: 403304796
# rubocop:enable Style/NumericLiterals
