# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "universal-ctags/universal-ctags"

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "advancecomp"
brew "ansible"
brew "asciidoctor"
brew "autoconf" # asdf dependency
brew "automake" # asdf dependency
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "dos2unix"
brew "exa"
brew "fish"
brew "fontforge"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp" # Vim dependency
brew "gnupg" # asdf-nodejs dependency
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "less"
brew "libtermkey"
brew "libtool" # asdf dependency
brew "libxslt" # asdf dependency
brew "libyaml" # asdf dependency
brew "media-info"
brew "memcached"
brew "most"
brew "multitail"
brew "neovim", args: ["HEAD"]
brew "onefetch"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "postgresql", restart_service: true
brew "puma/puma/puma-dev"
brew "python"
brew "ranger", link: false
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unixodbc" # asdf dependency
brew "w3m"
brew "wget"
brew "xz"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "font-fira-code-nerd-font"
cask "alacritty"
cask "iterm2-beta"
