# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "advancecomp"
brew "asciidoctor"
brew "autoconf" # asdf dependency
brew "automake" # asdf dependency
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "dos2unix"
brew "exa"
brew "fish"
brew "fontforge"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp" # Vim dependency
brew "gnupg" # asdf-nodejs dependency
brew "highlight"
brew "htop"
brew "imagemagick"
brew "jhead"
brew "less"
brew "libtermkey"
brew "libtool" # asdf dependency
brew "libxslt" # asdf dependency
brew "libyaml" # asdf dependency
brew "mas"
brew "media-info"
brew "most"
brew "neovim", args: ["HEAD"]
brew "onefetch"
brew "perl"
brew "python3"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "ssh-copy-id"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "unixodbc" # asdf dependency
brew "w3m"
brew "wget"
brew "xz"
brew "yarn"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "1password"
cask "alfred"
cask "arq"
cask "bartender"
cask "carbon-copy-cloner"
cask "daisydisk"
cask "dropbox"
cask "font-caskaydiacove-nerd-font"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "istat-menus"
cask "iterm2-beta"
cask "little-snitch"
cask "micro-snitch"
cask "microsoft-excel"
cask "microsoft-word"
cask "skype"
cask "viber"

# rubocop:disable Style/NumericLiterals
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "WiFi Explorer", id: 494803304
mas "e-Sword", id: 968437868
# rubocop:enable Style/NumericLiterals
